Autodesk.Revit.DB.ElementId.TryParse(System.String,Autodesk.Revit.DB.ElementId@)
Parse the string representation of the id into a corresponding ElementId.
Remarks:
If the string represents Autodesk::Revit::DB::Element::InvalidElementId the id
will contain it upon return. If the parse fails, the id will be undefined.
idStr: The string representation of the id to return.
id: Out parameter set to the ElementId represented by the string.
Returns: true if the string was successfully parsed into an ElementId, false otherwise.
Since: 2023

Autodesk.Revit.DB.ElementId.Parse(System.String)
Parse the string representation of the id into a corresponding ElementId.
Remarks:
If the string represents Autodesk::Revit::DB::Element::InvalidElementId it will be returned.
idStr: The string representation of the id to return.
Returns: ElementId string represented.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the string cannot be parsed into an ElementId.
Since: 2023

Autodesk.Revit.DB.ElementId.InvalidElementId
Get the invalid ElementId whose value is -1.

Autodesk.Revit.DB.ElementId.GetHashCode
Gets the value of the id as hash code

Autodesk.Revit.DB.ElementId.ToString
Gets a String representation of the value of the id.

Autodesk.Revit.DB.ElementId.Value
Provides the value of the element id as a 64-bit integer.
Since: 2024

Autodesk.Revit.DB.ElementId.IntegerValue
Provides the value of the element id as a 32-bit integer.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the value of the element id is too large to be represented as a 32-bit integer.

Autodesk.Revit.DB.ElementId.#ctor(System.Int64)
Create an ElementId handle with the given 64-bit integer id.
id: The id.
Since: 2024

Autodesk.Revit.DB.ElementId.#ctor(System.Int32)
Create an ElementId handle with the given 32-bit integer id.
id: The id.